---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PaddingLength
source: html/8bafb4d0-75bc-9404-47ae-d604986af5d3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PaddingLength Property

"Padding"

## Syntax (C#)
```csharp
public static ForgeTypeId PaddingLength { get; }
```